fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

// ++ Нагайцева
//Видимость реквизитов Абоненского договора

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВКМ_ВидимостьРеквизитовАбонентскогодоговора();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
		ВКМ_ВидимостьРеквизитовАбонентскогодоговора();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ВКМ_ВидимостьРеквизитовАбонентскогодоговора()
	АбонентскийДоговор = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");
	Если Объект.ВидДоговора = АбонентскийДоговор Тогда
	Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = Истина;
	Элементы.ВКМ_ДатаНачалаДействияДоговора.Доступность = Истина;
	Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = Истина;
	Элементы.ВКМ_ДатаОкончанияДействияДоговора.Доступность = Истина;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Доступность = Истина;
	Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
	Элементы.ВКМ_СуммаАбонентскойПлаты.Доступность = Истина;
	Иначе
	Объект.ВКМ_ДатаНачалаДействияДоговора = "";
	Объект.ВКМ_ДатаОкончанияДействияДоговора = "";
	Объект.ВКМ_СтоимостьЧасаРаботы = 0;
	Объект.ВКМ_СуммаАбонентскойПлаты = 0;
	Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
	Элементы.ВКМ_СуммаАбонентскойПлаты.Доступность = Ложь;	
	Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = Ложь;
	Элементы.ВКМ_ДатаНачалаДействияДоговора.Доступность = Ложь;
	Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = Ложь;
	Элементы.ВКМ_ДатаОкончанияДействияДоговора.Доступность = Ложь;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

//--
